{
    "role": "HR",
    "questions": [
        "Can you tell me about yourself?",
        "Why are you interested in this company?",
        "What are your strengths and weaknesses?",
        "How do you handle conflict at work?",
        "Where do you see yourself in 5 years?",
        "Can you describe a time you worked in a team?",
        "Why did you leave your last job?",
        "How do you handle stress and pressure?",
        "What motivates you to do your best work?",
        "How do you handle criticism?",
        "Describe a time you faced a difficult situation at work.",
        "How do you balance work and personal life?",
        "What is your preferred working style?",
        "Describe a time you had to adapt to change.",
        "How do you handle disagreements with colleagues?",
        "Why should we hire you?",
        "What do you know about our company culture?",
        "Describe your ideal work environment.",
        "How do you prioritize tasks?",
        "Have you ever had a conflict with a manager? How did you resolve it?",
        "Tell me about a time you took initiative.",
        "How do you approach learning new skills?",
        "Describe a situation where you went above and beyond.",
        "What kind of manager brings out the best in you?",
        "Tell me about a mistake you made and what you learned.",
        "How do you handle tight deadlines?",
        "Describe your experience with performance evaluations.",
        "What do you consider your biggest achievement?",
        "How do you handle multiple tasks at once?",
        "Describe a time when you had to give bad news.",
        "How do you keep yourself organized?",
        "Tell me about a time you solved a difficult problem.",
        "How do you ensure effective communication with your team?",
        "What steps do you take to manage stress?",
        "Describe a time you disagreed with a company policy.",
        "What qualities do you value in a colleague?",
        "How do you maintain professionalism in challenging situations?",
        "Tell me about a time you had to persuade someone.",
        "What strategies do you use to stay motivated?",
        "How do you handle repetitive or boring tasks?",
        "Describe a time when you had to handle confidential information.",
        "What do you do when you face a difficult client or coworker?",
        "How do you manage work-life balance during busy periods?",
        "Tell me about a project where you were a key contributor.",
        "How do you adapt to new workplace technology?",
        "Describe your approach to teamwork.",
        "What is your greatest professional failure and how did you recover?",
        "How do you handle competing priorities?",
        "Tell me about a time you exceeded expectations.",
        "What does success look like for you?",
        "Describe a time you helped improve a process at work.",
        "How do you handle workplace stress during deadlines?",
        "What motivates you to continue learning professionally?",
        "Tell me about a time you had to learn something quickly.",
        "How do you handle negative feedback?",
        "Describe your approach to mentoring or helping colleagues.",
        "What do you do if you disagree with company leadership?",
        "Tell me about a time you had to meet a challenging goal.",
        "Describe a time you had to adjust your priorities quickly.",
        "How do you ensure you communicate clearly?",
        "What is your approach to conflict resolution?",
        "Describe a time you had to manage multiple stakeholders.",
        "How do you motivate yourself during repetitive tasks?",
        "Tell me about a time you took ownership of a project.",
        "What strategies do you use to stay productive?",
        "Describe a situation where you had to handle a difficult team member.",
        "How do you approach goal setting?",
        "What steps do you take to maintain a positive attitude at work?",
        "Describe a time when your work impacted the team positively.",
        "How do you approach learning from mistakes?",
        "Tell me about a time you had to adapt to an unexpected change.",
        "What strategies do you use to build rapport with colleagues?",
        "How do you handle high-pressure situations?",
        "Describe a time you helped resolve a team conflict.",
        "What role do you usually take on in a team?",
        "How do you approach giving constructive feedback?",
        "Tell me about a time you handled a difficult customer or client.",
        "What motivates you to go beyond your job description?",
        "Describe a time when you had to balance multiple projects.",
        "How do you handle criticism from peers?",
        "What is your approach to personal and professional development?",
        "Describe a time you had to adapt your communication style.",
        "How do you manage expectations with supervisors or clients?",
        "Tell me about a time you successfully worked under pressure.",
        "What is your strategy for handling tight deadlines?",
        "Describe a situation where you had to resolve a disagreement.",
        "How do you stay organized with multiple responsibilities?",
        "Tell me about a time you collaborated with a difficult coworker.",
        "What steps do you take to ensure clear communication?",
        "Describe a time when you demonstrated leadership without authority.",
        "How do you handle repetitive or monotonous work?",
        "What motivates you to keep improving professionally?",
        "Describe a time you handled confidential information responsibly.",
        "How do you maintain motivation during long-term projects?",
        "Tell me about a time you had to make a quick decision.",
        "Describe your approach to teamwork in challenging situations.",
        "How do you handle conflicting priorities?",
        "What strategies do you use to handle workplace stress?",
        "Tell me about a time you resolved a challenging situation with a colleague.",
        "How do you adapt to new organizational processes or policies?",
        "Describe a time you helped improve team performance.",
        "What motivates you to achieve your professional goals?",
        "How do you maintain focus on long-term objectives?",
        "Tell me about a time you had to mediate a disagreement."
    ]
}