{
    "role": "Manager",
    "questions": [
        "How do you motivate your team?",
        "Can you describe a time when you resolved a team conflict?",
        "What strategies do you use for project management?",
        "How do you prioritize tasks when managing multiple projects?",
        "Describe a time you made a tough decision at work.",
        "How do you measure the success of your team?",
        "What is your approach to giving feedback?",
        "How do you handle underperforming team members?",
        "Describe a situation where you had to manage a difficult employee.",
        "What leadership style do you adopt?",
        "How do you delegate tasks effectively?",
        "Describe a time you managed a project under tight deadlines.",
        "How do you handle changes in project scope?",
        "What is your approach to strategic planning?",
        "Describe a time you led a cross-functional team.",
        "How do you develop talent within your team?",
        "What steps do you take to resolve conflicts within your team?",
        "Describe your approach to performance reviews.",
        "How do you manage stakeholder expectations?",
        "Describe a time you successfully implemented a new process.",
        "How do you ensure team alignment with company goals?",
        "Describe a time you motivated a team to achieve high performance.",
        "How do you handle poor team morale?",
        "What strategies do you use to manage remote teams?",
        "Describe a time you had to make a high-risk decision.",
        "How do you set short-term and long-term goals?",
        "Describe a time you handled a project failure.",
        "How do you ensure clear communication across teams?",
        "Describe a time you resolved a conflict between employees.",
        "How do you manage competing priorities?",
        "Describe your approach to change management.",
        "How do you handle team members resistant to change?",
        "Describe a time you successfully coached an employee.",
        "How do you foster collaboration across departments?",
        "Describe a time you turned around an underperforming team.",
        "How do you evaluate project risks?",
        "Describe your approach to budgeting and resource allocation.",
        "How do you handle conflicts with upper management?",
        "Describe a time you improved team efficiency.",
        "How do you develop leadership in others?",
        "Describe a time you handled a difficult client or stakeholder.",
        "How do you approach decision-making under uncertainty?",
        "Describe a time you implemented a successful strategy.",
        "How do you manage project deadlines and deliverables?",
        "Describe your approach to mentorship.",
        "How do you motivate team members who lack engagement?",
        "Describe a time you resolved a crisis situation.",
        "How do you maintain accountability in your team?",
        "Describe a time you had to make a controversial decision.",
        "How do you handle conflicting priorities from multiple stakeholders?",
        "Describe your approach to project planning.",
        "How do you foster innovation within your team?",
        "Describe a time you resolved a communication breakdown.",
        "How do you ensure team members are aligned with objectives?",
        "Describe a time you successfully managed change.",
        "How do you handle underperforming projects?",
        "Describe a time you facilitated a difficult meeting.",
        "How do you manage high-pressure situations?",
        "Describe your approach to employee recognition and rewards.",
        "How do you handle conflicts between team goals and company goals?",
        "Describe a time you successfully negotiated a deal.",
        "How do you approach talent retention?",
        "Describe a time you managed a high-performing team.",
        "How do you develop trust with your team?",
        "Describe a time you implemented a new workflow.",
        "How do you manage interdepartmental dependencies?",
        "Describe a time you turned a failing project around.",
        "How do you handle feedback from upper management?",
        "Describe your approach to crisis management.",
        "How do you delegate effectively under tight deadlines?",
        "Describe a time you managed a team with diverse skillsets.",
        "How do you measure team productivity?",
        "Describe a time you handled a challenging stakeholder request.",
        "How do you encourage collaboration in your team?",
        "Describe a time you managed conflict during a project.",
        "How do you set and track KPIs for your team?",
        "Describe your approach to risk management.",
        "How do you handle conflicting personalities in a team?",
        "Describe a time you successfully implemented a cost-saving initiative.",
        "How do you balance short-term results with long-term strategy?",
        "Describe a time you motivated a team through change.",
        "How do you approach decision-making when data is limited?",
        "Describe your experience managing budgets and resources.",
        "How do you ensure team accountability?",
        "Describe a time you implemented performance improvement plans.",
        "How do you foster a positive team culture?",
        "Describe a time you had to influence without authority.",
        "How do you handle team conflicts in remote settings?",
        "Describe a time you successfully met challenging targets.",
        "How do you encourage innovation and creativity in your team?",
        "Describe your approach to mentoring junior managers.",
        "How do you deal with unexpected project setbacks?",
        "Describe a time you successfully managed stakeholder expectations.",
        "How do you handle performance issues in high-performing employees?",
        "Describe a time you implemented a new leadership initiative.",
        "How do you prioritize tasks and projects for your team?",
        "Describe a time you turned team feedback into actionable improvements.",
        "How do you manage team stress during peak workloads?",
        "Describe a time you led a team through organizational change.",
        "How do you evaluate team performance objectively?"
    ]
}