{
    "role": "Tech",
    "questions": [
        "Can you explain your experience with [specific programming language]?",
        "What is the difference between a list and a tuple?",
        "Describe a challenging technical problem you solved.",
        "How do you optimize the performance of your code?",
        "What is object-oriented programming and why is it useful?",
        "Explain the difference between SQL and NoSQL databases.",
        "How do you handle version control and Git workflows?",
        "Can you describe a project where you implemented [specific technology]?",
        "What are RESTful APIs and why are they important?",
        "Explain the concept of recursion with an example.",
        "How do you debug code effectively?",
        "What is the difference between synchronous and asynchronous programming?",
        "Describe a time you improved an existing system.",
        "Explain the difference between front-end and back-end development.",
        "What is the role of unit testing in software development?",
        "How do you handle code reviews?",
        "Describe a situation where you fixed a critical bug.",
        "Explain the difference between HTTP and HTTPS.",
        "What is a data structure and why is it important?",
        "Describe the difference between a stack and a queue.",
        "What are design patterns and can you give an example?",
        "Explain the difference between compiled and interpreted languages.",
        "How do you manage dependencies in a project?",
        "Describe your experience with cloud services.",
        "What is a database index and why is it useful?",
        "Explain the difference between GET and POST requests.",
        "Describe a time you optimized a slow-running query.",
        "What is multithreading and when would you use it?",
        "Explain the difference between deep copy and shallow copy.",
        "How do you ensure code scalability?",
        "Describe a project where you implemented security best practices.",
        "Explain the difference between agile and waterfall methodologies.",
        "What is continuous integration and deployment (CI/CD)?",
        "How do you handle merge conflicts in Git?",
        "Describe a time you had to learn a new technology quickly.",
        "Explain the difference between synchronous and asynchronous APIs.",
        "What are microservices and why are they used?",
        "Describe the Model-View-Controller (MVC) architecture.",
        "Explain how hashing works and where it is used.",
        "What is the difference between REST and GraphQL?",
        "How do you optimize database queries?",
        "Describe your experience with containerization (e.g., Docker).",
        "Explain the difference between a process and a thread.",
        "How do you handle memory leaks in a program?",
        "What are the SOLID principles in software design?",
        "Describe a time you refactored code for better performance.",
        "Explain how caching can improve application performance.",
        "What is a deadlock and how do you prevent it?",
        "Describe your experience with version control branching strategies.",
        "How do you ensure secure data transmission?",
        "What are web sockets and when would you use them?",
        "Explain the difference between pass-by-value and pass-by-reference.",
        "Describe your experience with testing frameworks.",
        "How do you profile and debug performance issues?",
        "Explain the difference between REST API status codes 200, 400, and 500.",
        "Describe a time you solved a concurrency problem.",
        "What is the difference between SQL JOIN types?",
        "How do you design a database schema for a new application?",
        "Explain how load balancing works.",
        "Describe a time you improved system reliability.",
        "What are the advantages of using NoSQL databases?",
        "Explain the concept of normalization in databases.",
        "How do you handle exceptions in your code?",
        "Describe a time you automated a repetitive task.",
        "What is the difference between a class and an object?",
        "Explain the difference between interface and abstract class.",
        "How do you handle large datasets efficiently?",
        "Describe a time you implemented a RESTful API.",
        "Explain how you would secure a web application.",
        "What is a singleton pattern and when would you use it?",
        "Describe the difference between GET, POST, PUT, and DELETE requests.",
        "How do you prevent SQL injection attacks?",
        "What is version control and why is it important?",
        "Explain the difference between encryption and hashing.",
        "Describe a time you used a queue or stack in a project.",
        "How do you handle multithreading in your applications?",
        "What are the advantages of using containers?",
        "Explain how a load balancer distributes traffic.",
        "Describe your experience with APIs integration.",
        "What is the difference between local storage and session storage?",
        "How do you optimize front-end performance?",
        "Describe a time you debugged a complex issue.",
        "Explain the difference between strong and weak typing.",
        "How do you handle logging and monitoring?",
        "Describe a time you had to scale an application.",
        "What is the difference between relational and non-relational databases?",
        "Explain how caching improves performance.",
        "Describe a time you used algorithms to optimize a solution.",
        "What is a race condition and how do you prevent it?",
        "Explain the difference between REST and SOAP.",
        "How do you secure API endpoints?",
        "Describe your experience with automated testing.",
        "What is continuous integration and why is it important?",
        "Explain how you handle database migrations.",
        "Describe a time you optimized an algorithm.",
        "What is a binary tree and where is it used?",
        "Explain the difference between front-end frameworks (React, Angular, Vue).",
        "Describe how you handle deployment issues.",
        "What is the difference between TCP and UDP?",
        "How do you ensure code quality?",
        "Explain a time you improved system security.",
        "Describe your experience with cloud computing platforms.",
        "What is the difference between HTTP/1.1 and HTTP/2?",
        "Explain how you handle versioning in APIs.",
        "Describe a time you improved database performance.",
        "What are the benefits of using microservices architecture?",
        "Explain the difference between synchronous and asynchronous tasks.",
        "Describe your experience with message queues.",
        "How do you ensure your application is fault-tolerant?",
        "What is the difference between monolithic and microservices architectures?",
        "Explain a time you implemented a new technology successfully.",
        "Describe your experience with container orchestration (e.g., Kubernetes).",
        "How do you handle concurrency issues in your programs?",
        "Explain the difference between stack and heap memory."
    ]
}